---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.Dispose
source: html/0e5d4b5b-6d8f-acf5-bbbe-26976005995f.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.Dispose Method

Releases all resources used by the EffectInstance

## Syntax (C#)
```csharp
public void Dispose()
```